# Author : Χρήστος Κωνσταντινίδης
# Κωδικός: ΜΠΛ19029

"""
Ασκηση 13
Γράψτε ένα πρόγραμμα σε Python το οποίο διαβάζει από ένα αρχείο έναν πίνακα 3x3 ο οποίος έχει γραφεί ως αρχείο κειμένου
όπου κάθε γραμμή του είναι γραμμή του πίνακα και τα στοιχεία διαχωρίζονται με κενά.
 Ο πίνακας αποθηκεύεται με τη μορφή εμφωλευμένης λίστας και εμφανίζετε στον χρήστη την ορίζουσά του.
"""
import numpy as np
file_in=open("askisi13.txt", "r")
a=list()#Δημιουργία άδειας λίστας
for line in file_in:
    b = []#Δημιουρία ενός άδειου πίνακα
    for chr in line:#Δίαβασμα γραμμών τπυ αρχείου
        if (chr=='\n' or chr==' '): # Διάβασμα των χαρακτήρων μέσα στην γραμμή
            print(f'{chr!a} ο χαρακτήρας αναγνωρίστηκε ως "white character" και απορρίφθηκε')
        else:
            print(f'{chr!a} ο χαρακτήρας είναι έγκυρος')
            b.append(ord(chr)) #εισαγωγή στον πίνακα
    a.append(b)#push στη λίστα
file_in.close()#κλείσιμο αρχείου
a=np.array(a)#μετατροπη του πίνακα σε numpy array
print("Πίνακας τιμών ASCII:")
print(a)
print(f'Ορίζουσα D={np.linalg.det(a):2f}')

