"""
    ΜΑΘΗΤΗΣ: ΜΠΠΛ19029
      ΟΝΟΜΑ: ΧΡΗΣΤΟΣ ΚΩΝΣΤΑΝΤΙΝΙΔΗΣ
       ΘΕΜΑ: 4
    Για τον υπολογισμό των πρώτων αριθμών χρησιμοποιώ το θεώρημα του Wilson
    στο οποίο ο κανόνας λέει ένας αριθμό p>1 είναι πρώτος αν και μόνο αν:

                            (p - 1)! % p ≡  (p-1) |=| ((p - 1)! % p + 1) ≡ p
    π.χ.
    Αν p=5,τότε, (p-1)! % 5 = 4! % 5 = (1 * 2 * 3 * 4) % 5 = 24 % 5 = 4
"""
#Ορισμοί συναρτήσεων
def factorial(n):
    if n > 1:
        return n*factorial(n - 1)
    else:
        return 1

#Πεδία προγραμματος

# Αθροιστής τιμών ASCII κειμένου
suma = 0

# Υπόλοιπο διαίρεσης (p - 1)! % p
rest = 0

#Κυριώς πρόγραμμα
#Εισαγωγή αλφθαρμητικού από τον χρήστη
print("INFO:H χαρακτήρες π.χ: [%,;,e,k,m,q] αντιστοιχούν στους πρώτους αριθμούς [37,59,101,107,109,113]\n")
num = input("Εισάγεται ένα αλφαριθμητικό:")

#Μετατροπη κειμενου σε αριθμο χρησιμοποιώντας ισοδύναμες αριθμιτικές τιμές κατά ASCII
for chr in num:
    suma = suma + ord(chr)

#Συγκεφαλεώση της εισαγωγής του χρήστη και του αριθμιτικού ισοδύναμου κατα ASCII
print(f"\nΤο εισαγμένο αλφαριθμητικό '{num}' είναι ισοδύναμο κατά ASCII με τον αριθμό {suma}, ", end=" ")

factorialN = factorial(suma-1)
rest = factorialN % suma

#Ελεγχός του αποτελέσματος και εξαγωγή συμπεράσματος
if suma == (rest+1):
    print("που είναι πρώτος αριθμός.")
else:
    print("που δεν είναι πρώτος αριθμός.")